updated and fix it
